### Pandas - Missing Data

In [1]:
import numpy as np
import pandas as pd

In [2]:
# MAkeing our dataframe with some missing values

d = {'A':[1,2,np.nan], 'B':[5,np.nan,np.nan],'C':[1,2,3]}

df = pd.DataFrame(d)

df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [3]:
# Drop null method - drops any rows that have one or missing values, by default axis = 0

df.dropna()

     A    B  C
0  1.0  5.0  1

In [4]:
# Drop columns having null values

df.dropna(axis = 1)

   C
0  1
1  2
2  3

In [16]:
df.dropna(thresh = 2) # Removing those rows with atleast 2 null values

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [17]:
# Filling the missing values

df.fillna(value = "FILL")

      A     B  C
0   1.0   5.0  1
1   2.0  FILL  2
2  FILL  FILL  3

In [19]:
# Fill with mean of the column

df["A"].fillna(value=df["A"].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

Filling of missing data depends upon the type of data we have

In [21]:
# Groupby - allows you to group together rows based off of a column and perform aggregate functions on them



data = {'Company':["GOOG","GOOG","MSFT","MSFT","FB","FB"],
        'Person':["Sam","Charlie","Amy","Vanessa","Carl","Sarah"],
        'Sales':[300,120,340,124,243,350]}

In [22]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    300
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [24]:
# Gruping by company

bycomp = df.groupby('Company')
bycomp.mean()

         Sales
Company
FB       296.5
GOOG     210.0
MSFT     232.0

In [25]:
bycomp.sum()

         Sales
Company
FB         593
GOOG       420
MSFT       464

In [26]:
bycomp.std()

              Sales
Company
FB        75.660426
GOOG     127.279221
MSFT     152.735065

In [27]:
bycomp.sum().loc["FB"]

Sales    593
Name: FB, dtype: int64

In [28]:
# doing it in one line

df.groupby('Company').sum().loc["FB"]

Sales    593
Name: FB, dtype: int64

In [30]:
df.groupby('Company').count() # gives the count  of people we have

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [32]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  210.000000  232.000000
      std     75.660426  127.279221  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  165.000000  178.000000
      50%    296.500000  210.000000  232.000000
      75%    323.250000  255.000000  286.000000
      max    350.000000  300.000000  340.000000